Revit 2027 API
BuiltInFailures.GeneralFailures.CannotFixProblem Property
 Failed to fix problem. Action has to be cancelled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotFixProblem { get; }
Public Shared ReadOnly Property CannotFixProblem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotFixProblem {
	FailureDefinitionId^ get ();
}
static member CannotFixProblem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace